프리랜서 등록
- 지원 자격과 동의서의 경우 페이지 최초 접근 시 모달 창으로 제공하며 동의하지 않을 시 전 페이지로 리다이렉트
<!-- - 프로필 사진 등록 시 허용 확장자는 jpg, png, bmp, tiff로 제한 -->
<!-- - 프로필 사진 미등록 시 언노운 이미지 출력 -->
<!-- - 주소 검색 기능은 적합한 api를 통해 구현 -->
- 프리랜서 신청 시 신청인 연락처/E-mail로 자동 메시지가 가는 기능 염두
<!-- - 사용 언어의 경우 관리자 페이지에서 카테고리나 항목을 관리할 수 있음 -->
<!-- - 첨부 파일의 경우 파일당 2MB으로 제한하며 5개까지 가능 --> 2mb제한 확인하기
<!-- - 신천 버튼 작동 시 모달 창으로 등록된 신청서는 수정/삭제가 불가능 하다는 메시지 출력 -->
<!-- - 신청 후 메인 페이지로 리다이렉트 -->
<!-- - 신청 후 신청 e-mail 보내기/검수 여부에 따라 e-mail 보내기 -->

<!-- 기밀유지 -->
<!-- - 다운로드 버튼 클릭 시 설정한 파일 다운로드 -->
<!-- - 다운로드 버튼에 걸어둘 파일은 관리자 페이지에서 관리 가능해야 함 -->

<!-- 제휴 등록 -->
<!-- - 지원 자격과 동의서의 경우 페이지 최초 접근 시 모달 창으로 제공하며 동의하지 않을 시 전 페이지로 리다이렉트
- 프로필 사진 등록 시 허용 확장자는 jpg, png, bmp, tiff로 제한
- 프로필 사진 미등록 시 언노운 이미지 출력
- 주소 검색 기능은 적합한 api를 통해 구현
- 프리랜서 신청 시 신청인 연락처/E-mail로 자동 메시지가 가는 기능 염두
- 사용 언어의 경우 관리자 페이지에서 카테고리나 항목을 관리할 수 있음
- 첨부 파일의 경우 파일당 2MB으로 제한하며 5개까지 가능
- 신천 버튼 작동 시 모달 창으로 등록된 신청서는 수정/삭제가 불가능 하다는 메시지 출력
- 신청 후 메인 페이지로 리다이렉트 -->

포트폴리오 리스트 페이지
<!-- -회사 로고로 리스트 채움 -->

포트폴리오 디테일
<!-- 기밀 일시 모든 정보 미공개 -->
<!-- 1.통역인지 번역인지에 따라 보여주는 리스트 변경 -->
<!-- 2.다른 포트폴리오 보기는 같은 분야로 설정 -->
<!-- - 다운로드 버튼에 걸어둘 파일은 관리자 페이지에서 관리 가능해야 함 -->

<!-- 어드민페이지 손보기 (보이기 안보이기 수정 기능 없애기 등) -->
<!-- -회사 로고로 리스트 채움 -->

<!-- 회사로고 -->
<!-- 프로필이미지 -->
<!-- 게시판 프리뷰 이미지 나오게하기 -->


<!-- 포트 폴리오 base get 에서 분야 필드는는 머임? -->
<!-- admin에서 프리랜서 검색기능 -->





1. 불필요 메뉴 및 영역 삭제
<!-- - http://localhost/admin/main/index?mainMenu=%EB%A9%94%EC%9D%B8 -->
<!-- - http://localhost/admin/main/index?mainMenu=main&subMenu=dashboard&mainMenu=main&subMenu=dashboard -->
<!-- - http://localhost/user/update -->
<!-- - http://localhost/user/get -->
<!-- - ads -->
<!-- 2. 프리랜서 페이지에서 사이드바 메뉴 순서 변경 -->
<!-- - 프리랜서 / 설정 순서 -->
<!-- 3. 프리랜서 추가/수정 시 항목 이름 변경 -->
<!-- 4. 번역/통역 메뉴에서 기밀 보안 파일 설정 삭제 -->
<!-- 5. 기밀 보안 파일 설정 페이지 메인 -> 설정으로 이동 (기존 설정 항목은 삭제) -->
<!-- 6. 번역/통역 의뢰 페이지의 리스트 상에서 고객 이름, 회사, 포트폴리오로 노출 상태 확인하는 항목 추가 -->
<!-- 7. 번역/통역 의뢰 추가/수정 시 항목 이름 변경 -->
<!-- 8. 제휴 문의 리스트에서 회사 이름 항목 추가 -->
<!-- 9. 제휴 문의 상세보기에서 회사 이름, 이메일, 담당자 연락처가 보이지 않음 -->
<!-- 10. 제휴 문의에서 추가/수정 버튼이 왜 필요한지 -->
11. 이메일 페이지가 어디에서 사용되는지
<!-- 12. 관리자가 고객센터에 글 쓰려면 어떻게 해야 하는지 -->
<!-- 어드민 체크해본거에요 -->

<!-- 생일 년도 -->
<!-- 제휴사 x표문제 -->
<!-- 의뢰 할떄 개인,회사 email -->
<!-- 무한스크롤 로딩 이미지 -->

도메인연결, 1~2소요
이메일 테스트,
 파일 이전

<!-- 포트폴리오 디테일에서 다른 거보기 안누럴짐 -->