로그인 로그
좋아오 싫어요 기능
파일 다운로드 유저레벨 기능
동영상 업로드기능


문의좀 드리려구용. 프로그램 실행하고 <자동추출> 눌렀을때 특정 폴더만 불러올 수 있도록 기능추가 가능할까용? ; ㅁ;

보안코드뜨면 폼창 포커스
일반모드 슬떄 \n
자동추출
삭제기능
dgv자동으로 불러오기
waitone 보안코드 관련 수정
xml엑셀 수정방법없나?
네이버 비밀번호 *
기업형 라이센스?
예약기능

건의게시판 바로가기 버튼
<!-- 엑셀 2가지버전기능 -->
리버싱 엔지니어 방지
글쓰기 각종기능
글쓴거 삭제기능
건의 게시판 이용하게 프로그램에 문구
프로그램 아이콘 등 디자인
프로그램 상태, 프로그램 로그

개발자노트
결제기능
가격정책

가입기 저장기능
스케쥴 내용 column row변경기능
<!-- 동시접속 못하게 -->
<!-- 라이센스 접속 로그 -->
<!-- 첫번쨰카테고리 열기버그 -->
<!-- 댓글비허용 -->
<!-- 무한반복기능 -->
<!-- 정지기능 -->
캡챠코드기능



상품옵션
주문기능

sms 기능
상품 리뷰기능

수정 할떄 네비게이션
<!-- sns 로그인기능 -->
<!-- 로그인상태유지 -->

<!-- 회원정보창에서 sns 연동버튼? -->
<!-- sns회원가입 창에서 기존아이디 연동버튼? -->
<!-- 탈퇴버튼? -->